Revit 2018 API
BuiltInFailures.ImportFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.ImportFailures type exposes the following members.
Properties
Name | Description
BadFaceFoundInDwg
 One or more hatch regions were found in the imported file with unconnected boundaries. These hatch regions will be ignored.
CannotChangeImportSymbol
 Can't change an imported or linked element's symbol type.
CannotExplodeElement
 Can't explode the imported object.
CannotImportFile
 Can't import file.
CannotRelinkWrapper
 [Description]
FailedToSetWorkplane
 Could not set Work Plane of [Import].\n\nPlease use the Work Plane tool to set a Work Plane for this view.
IFCCantUpdateLinkedFile
 The cached version of this IFC file is already loaded into another document in this session, and can't be updated. To update the IFC file, please close all other documents containing the link, and then update.
IFCGenericImportWarning
 The following problems were encountered in the IFC file: [Description]
IFCGenericRevitImportWarning
 Revit had the following problems importing the IFC file: [Description]
ImportModelOutOfRange
 The imported model is out of range.
ImportModelTooLarge
 The imported model is too large.
ImportTooFarAway
 Imported objects located a large distance from the model might not display properly. The 'Center-to-Center' option will be used.
ImportTooManyElmentsToExplode
 Import Instance has [Number] elements. Imports with more than 10,000 elements cannot be exploded.
LostAcisObjectsOnImport
 Some ACIS objects could not be imported. To import them, use AutoCAD to convert them into polymesh objects and reimport.
SomeObjectsNotExploded
 Import contained 3D data or points which can't be exploded. Only 2D data was exploded.
TextNotImported
 Text is only imported if the "Current View Only" option is selected. To see the text in the original file, import again with this check box selected in the Import Dialog.
TooManyPickFaces
 Too many faces were created from imported meshes. Host by Face tools may not select the imported meshes correctly. Decrease the complexity of the file or try importing only selected layers to resolve.
WorksetCreatedForLinkWarning
 Newly created link types and instances were placed in new workset [workset name]
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace